def enter():
    while True:
        a = input("Щоб вийти з програми, виведіть 'ex'. Введіть число: ")
        if a.lower() == "ex":
            exit(0)
        try:
            return float(a)
        except ValueError:
            print("Невірний вхід. Введіть дійсний номер.")

def actions(a):
    print("\nДоступні дії:")
    print("+ — додавання, - — віднімання, !- — віднімання з операндами, поміняними місцями")
    print("* — множення, / — ділення, !/ — ділення з операндами, поміняними місцями")
    print("^ — піднесення до ступеня, !^ — зворотне піднесення до ступеня (нестандартна операція)")
    print("або «ex», щоб вийти з програми")

    action = input("Виберіть дію: ").strip()
    if action.lower() == "ex":
        print(f"Ваш поточний результат = {a}")
        exit(0)
    elif action in ["+", "-", "!-", "*", "/", "!/", "^", "!^"]:
        return action
    else:
        print("Недійсна дія. Спробуйте ще раз.")
        return actions(a)