#Протестувати базові функції для рядків
text = " Привіт, світ! "

#Базові функції для роботи з рядками
print("Оригінальний рядок:", text)
print("Довжина рядка:", len(text)) #Довжина рядка
print("Без пробілів спереду і ззаду:", text.strip()) #Видалення пробілів
print("Ура великі літери:", text.upper()) #Перетворення на великі літери
print("Усі малі літери:", text.lower()) #Перетворення на малі літери
print("Чи починається з 'Привіт':", text.startswith("Привіт")) #Перевірка початку
print("Чи закінчується на '!':", text.endswith("!")) #Перевірка кінця
print("Замінюємо 'світ' на 'друже':", text.replace("світ", "друже")) #Заміна частини тексту
print("Розділення на слова:", text.split()) #Розбиття рядка на слова